from0to19 = ['0', 'εἶς', 'δύο', 'τρεῖς', 'τέτταρες', 'πέντε', 'ἕξ', 'ἑπτά', 'ὀκτώ', 'ἐννέα', 
             'δέκα', 'ἔνδεκα', 'δώδεκα', 'τρειςκαίδεκα', 'τέτταρες καὶ δέκα', 'πεντεκαίδεκα', 'ἑκκαίδεκα', 'ἑπτακαίδεκα', 'ὀκτωκαίδεκα', 'ἐννεακαίδεκα']

tens = ['0', 'δέκα', 'εἴκοσιν', 'τριάκοντα', 'τετταράκοντα', 'πεντήκοντα', 'ἑξήκοντα', 'ἑβδομήκοντα', 'ὀγδοήκοντα', 'ἐνενήκοντα']
hundreds = ['0', 'ἑκατόν', 'διακόσιοι', 'τριακόσιοι', 'τετρακόσιοι', 'πεντακόσιοι', 'ἑξακόσιοι', 'ἑπτακόσιοι', 'ὀκτακόσιοι', 'ἐνακόσιοι']
thousands = [s + 'χίλιοι' for s in ['0', '', 'δισ', 'τρισ', 'τετρακισ', 'πεντακισ', 'ἑξακισ', 'ἑπτακισ', 'ὀκτακισ', 'ἐνακισ']]
tenthousands = [s + 'μύριοι' for s in ['0', '', 'δισ', 'τρισ', 'τετρακισ', 'πεντακισ', 'ἑξακισ', 'ἑπτακισ', 'ὀκτακισ', 'ἐνακισ']]

def translate_to_greek(x):
    if x == 100000:
        return 'δεκακισμύριοι'
    res = ''
    if x % 100 <= 19:
        res = from0to19[x % 100]
    else:
        if x % 10 > 0:
            res = from0to19[x % 10] + ' καὶ '
        res += tens[(x // 10) % 10]
    x = x // 100
    if x == 0:
        return res
    if x % 10 > 0:
        res += ' καὶ ' + hundreds[x % 10]
    x = x // 10
    if x == 0:
        return res
    if x % 10 > 0:
        res += ' καὶ ' + thousands[x % 10]
    x = x // 10
    if x == 0:
        return res
    if x % 10 > 0:
        res += ' καὶ ' + tenthousands[x % 10]
    return res